The API is accepting the `nic_type` and `reservation_affinity` values, but is not returning them. Moving forward is blocked until they are returned.

```
------- Stdout: -------
=== RUN   TestAccNotebooksInstance_notebookInstanceFullExample
=== PAUSE TestAccNotebooksInstance_notebookInstanceFullExample
=== CONT  TestAccNotebooksInstance_notebookInstanceFullExample
provider_test.go:276: Step 1/2 error: After applying this test step, the plan was not empty.
stdout:
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
Terraform will perform the following actions:
# google_notebooks_instance.instance must be replaced
-/+ resource "google_notebooks_instance" "instance" {
boot_disk_size_gb  = 110
boot_disk_type     = "PD_SSD"
~ create_time        = "2021-08-11T18:37:20.571975308Z" -> (known after apply)
~ id                 = "projects/ci-test-project-188019/locations/us-central1-a/instances/tf-test-notebooks-instance9stbsw1iss" -> (known after apply)
install_gpu_driver = true
instance_owners    = [
"admin@hashicorptest.com",
]
~ labels             = {
- "goog-caip-notebook" = "" -> null
"k"                  = "val"
}
location           = "us-central1-a"
machine_type       = "e2-medium"
metadata           = {
"terraform" = "true"
}
name               = "tf-test-notebooks-instance9stbsw1iss"
~ network            = "https://www.googleapis.com/compute/v1/projects/ci-test-project-188019/global/networks/default" -> "projects/ci-test-project-188019/global/networks/default"
+ nic_type           = "VIRTIO_NET"
no_proxy_access    = true
no_public_ip       = true
~ project            = "ci-test-project-188019" -> (known after apply)
+ proxy_uri          = (known after apply)
service_account    = "hashicorp-test-runner@ci-test-project-188019.iam.gserviceaccount.com"
~ state              = "PROVISIONING" -> (known after apply)
~ subnet             = "https://www.googleapis.com/compute/v1/projects/ci-test-project-188019/regions/us-central1/subnetworks/default" -> "projects/ci-test-project-188019/regions/us-central1/subnetworks/default"
~ update_time        = "2021-08-11T18:37:44.138406509Z" -> (known after apply)
+ reservation_affinity {
+ consume_reservation_type = "NO_RESERVATION"
}
+ shielded_instance_config {
+ enable_integrity_monitoring = (known after apply)
+ enable_secure_boot          = (known after apply)
+ enable_vtpm                 = (known after apply)
}
~ vm_image {
image_family = "tf-latest-cpu"
project      = "deeplearning-platform-release"
}
}
Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccNotebooksInstance_notebookInstanceFullExample (67.67s)
FAIL
```